app/controllers/food_item_controller.rb

SELECT "food_items"."name" FROM "food_items"  WHERE "food_items"."id" = 2
---
  def show

    @id_requested = params[:id]
    @show_item = FoodItem.where(id: @id_requested).map { |item| item.name }