app/controllers/welcome_controller.rb

SELECT "food_items".* FROM "food_items"  WHERE "food_items"."cuisine" = 'Asian'
---
  def index


    # @item = FoodItem.all.sample
    @itemAsian = FoodItem.where(cuisine: "Asian").sample